# Don't Remove Credit Tg - @VJ_Botz
# Subscribe YouTube Channel For Amazing Bot https://youtube.com/@Tech_VJ
# Ask Doubt on telegram @KingVJ01

class script(object):
    START = """**ʜᴇʟʟᴏ {} 🤟**
   
<b>আমি একটি লিংক খুজে নেও্যা বট. আমাকে দিয়ে যে কোন চ্যানেলের লিংক খুজে নিতে পারবেন! 
আমি আপনার চ্যানেলের পোস্ট অটো ভাবে ফিল্টার করব এবং কেউ সঠিক নাম দিলে সাথে সাথেই গ্রুপে লিংক পেয়ে যাবেন.</b>"""

    HELP = """<b>💢 কি ভাবে আমাকে গ্রুপে ব্যাবহার করবেন

🔻 আমাকে আপনার গ্রুপের এডমিন এবং আপনার চ্যানেলের এডমিন দিন. 
🔻 sᴇɴᴅ /verify ɪɴ ɢʀᴏᴜᴘ & ᴡᴀɪᴛ ғᴏʀ ɪᴛ ᴛᴏ ᴀᴄᴄᴇᴘᴛ ᴏʀ ᴅɪʀᴇᴄᴛʟʏ ᴄᴏɴᴛᴀᴄᴛ ᴛᴏ ᴏᴡɴᴇʀ ᴀғᴛᴇʀ ʀᴇǫᴜᴇsᴛ @YABOTZ.
🔻 ᴀғᴛᴇʀ ᴠᴇʀɪғɪᴄᴀᴛɪᴏɴ sᴇɴᴅ /connect ʏᴏᴜʀᴄʜᴀɴɴᴇʟɪᴅ. ( ғᴏʀ ᴍᴜʟᴛɪᴘʟᴇ ᴄʜᴀɴɴᴇʟs ᴜsᴇ ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ ᴍᴜʟᴛɪᴘʟᴇ ᴛɪᴍᴇs )
🔻 ᴇxᴀᴍᴘʟᴇ : /connect -100xxxxxxxxxx

⭕ ғᴏʀ ғᴏʀᴄᴇ sᴜʙsᴄʀɪʙᴇ ᴜsᴇ 
/fsub (ғsᴜʙɪᴅ)
🔻 ᴅɪsᴄᴏɴɴᴇᴄᴛ ʙʏ /nofsub (ғsᴜʙɪᴅ)

❣️ ɢᴇᴛ ᴄʜᴀɴɴᴇʟ ɪᴅ ʙʏ ᴄᴏᴍᴍᴀɴᴅ - /id
❣️ ʀᴇᴍᴏᴠᴇ ᴀ ᴄʜᴀɴɴᴇʟ ᴡɪᴛʜ - /disconnect -100xxxxxxxxxxx
ᴛʜɪs ᴡɪʟʟ ʜᴇʟᴘ ʏᴏᴜ ᴛᴏ ʀᴇᴍᴏᴠᴇ ᴀ ɪɴᴅᴇxᴇᴅ ᴄʜᴀɴɴᴇʟ ғʀᴏᴍ ʏᴏᴜʀ ɢʀᴏᴜᴘ.

♨️ ɢᴇᴛ ᴄᴏɴɴᴇᴄᴛᴇᴅ ᴄʜᴀɴɴᴇʟs ʟɪsᴛ ᴡɪᴛʜ - /connections</b>"""

    ABOUT = """<b>╭━━━━━━━❰ [𝙰𝙱𝙾𝚄𝚃](https://t.me/YABOTZ) ❱━━━━━━━➣

┣ ✯ Mʏ Nᴀᴍᴇ:  {}
┣ ✯ Cʀᴇᴀᴛᴏʀ: <a href='https://t.me/YABOTZ'>YA Bᴏᴛᴢ</a>
┣ ✯ Lᴀɴɢᴜᴀɢᴇ: <a href='https://www.python.org'>Pʏᴛʜᴏɴ 3</a>
┣ ✯ DᴀᴛᴀBᴀsᴇ: <a href='https://cloud.mongodb.com/'>MᴏɴɢᴏDB</a></b>"""

    STATS = """<b>My Status 💫

👥 Users: {}
🧿 Groups: {}</b>"""

    BROADCAST = """<u>{}</u>

Total: `{}`
Remaining: `{}`
Success: `{}`
Failed: `{}`"""

    
