# Don't Remove Credit Tg - @VJ_Botz
# Subscribe YouTube Channel For Amazing Bot https://youtube.com/@Tech_VJ
# Ask Doubt on telegram @KingVJ01

class script(object):
    START = """**ʜᴇʟʟᴏ {} 🤟**
   
<b>আমি একটি লিংক খুজে নেও্যা বট. আমাকে দিয়ে যে কোন চ্যানেলের লিংক খুজে নিতে পারবেন! 
আমি আপনার চ্যানেলের পোস্ট অটো ভাবে ফিল্টার করব এবং কেউ সঠিক নাম দিলে সাথে সাথেই গ্রুপে লিংক পেয়ে যাবেন.</b>"""

    HELP = """<b>💢 কি ভাবে আমাকে গ্রুপে ব্যাবহার করবেন

🔻 আমাকে আপনার গ্রুপের এডমিন এবং আপনার চ্যানেলের এডমিন দিন. 
🔻 অনুসরণ /verify গ্রুপে প্রবেশ করুন এবং অনুরোধ গ্রহণের জন্য অপেক্ষা করুন অথবা অনুরোধের পরে মালিকের সাথে যোগাযোগের নির্দেশ দিন। @YABOTZ.
🔻 যাচাইকরণ পাঠানোর পর /connect আপনার চ্যানেল আইডি. ( মাল্টিপ্লে চ্যানেলের জন্য মাল্টিপ্লে টাইমস এই কমান্ডটি ব্যবহার করুন। )
🔻 ᴇxᴀᴍᴘʟᴇ : /connect -100xxxxxxxxxx

⭕ জোর করে সাবস্ক্রাইব ব্যবহারের জন্য 
/fsub (ғsᴜʙɪᴅ)
🔻 সংযোগ বিচ্ছিন্ন করুন /nofsub (অনুসরণ)

❣️ কমান্ডের মাধ্যমে চ্যানেল আইডি পান - /id
❣️ এর মাধ্যমে একটি চ্যানেল সরান - /disconnect -100xxxxxxxxxxx
এটি আপনার গ্রুপের জন্য একটি সূচীকৃত চ্যানেল সরাতে সাহায্য করবে।.

♨️ এর সাথে সংযোগ চ্যানেল তালিকা পান - /connections</b>"""

    ABOUT = """<b>╭━━━━━━━❰ [ABOUT](https://t.me/YABOTZ) ❱━━━━━━━➣

┣ ✯ আমার নাম:  {}
┣ ✯ মালিক: <a href='https://t.me/YABOTZ'>YA Bᴏᴛᴢ</a>
┣ ✯ মুভি চ্যানেল: <a href='https://t.me/+EZwSDjjpmRsyMDE1'>মুভি চ্যানেল</a>
┣ ✯ মুভি গ্রুপ: <a href='https://t.me/MovieChannel_Chat/'>মুভি গ্রুপ</a></b>"""

    STATS = """<b>My Status 💫

👥 Users: {}
🧿 Groups: {}</b>"""

    BROADCAST = """<u>{}</u>

Total: `{}`
Remaining: `{}`
Success: `{}`
Failed: `{}`"""

    
